# Задаем базовый образ, содержащий исходный образ Python
FROM python:3.9-slim

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем файлы зависимостей в контейнер
COPY requirements.txt ./

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все файлы из текущей директории в контейнер
COPY . .

# Определяем, какой порт будет открываться в контейнере (если нужно)
EXPOSE 8000

# Команда для запуска приложения при запуске контейнера
CMD [ "python", "main.py" ]